scc2425-tukano/src/main/test/artillery/users/delete_user.yaml
config:
  target: https://deployment-scc-backend-smd-71848.azurewebsites.net/rest
  phases:
    - name: delete_user
      duration: 5
      arrivalCount: 5
  payload:
    path: ../data/users.csv
    order: sequence
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "id"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoGetUsers
    flow:
      - delete:
          url: "/users/{{ id }}?pwd={{pwd}}"
          headers:
            Accept: application/json