scc2425-tukano/src/main/test/artillery/users/post_user.yaml
config:
  target: https://deployment-scc-backend-smd-71848.azurewebsites.net/rest
  phases:
    - name: post_user
      duration: 5
      arrivalCount: 5
  payload:
    path: ../data/users.csv
    order: sequence
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "id"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoRegister
    flow:
      - post:
          url: /users/
          headers:
            Content-Type: application/json
          json:
            id: "{{ id }}"
            pwd: "{{ pwd }}"
            email: "{{ email }}"
            displayName: "{{ displayName }}"