scc2425-tukano/src/main/test/artillery/users/put_user.yaml
config:
  target: https://deployment-scc-backend-smd-71848.azurewebsites.net/rest
  phases:
    - name: put_user
      duration: 5
      arrivalCount: 5
  payload:
    path: ../data/users-update.csv
    order: sequence
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "id"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoPutUsers
    flow:
      - put:
          url: "/users/{{ id }}?pwd={{pwd}}"
          headers:
              Content-Type: application/json
          json:
              id: "{{ id }}"
              pwd: "{{ pwd }}"
              email: "{{ email }}"
              displayName: "{{ displayName }}"